CF/Catalogs/ПризнакиПредметовРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ПризнакиПредметовРасчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПризнакаПредметаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Enums/ПризнакиПредметаРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПризнакиПредметаРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Реализуемый товар, за исключением подакцизного товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодакцизныйТовар</Name>
					<Comment>Реализуемый подакцизный товар</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
					<Comment>Выполняемая работа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Оказываемая услуга</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаАзартнойИгры</Name>
					<Comment>Прием ставок при осуществлении деятельности по проведению азартных игр</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыигрышАзартнойИгры</Name>
					<Comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению азартных игр</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛотерейныйБилет</Name>
					<Comment>Прием денежных средств при реализации лотерейных билетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыигрышЛотереи</Name>
					<Comment>Выплата денежных средств в виде выигрыша при осуществлении деятельности по проведению лотерей</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставлениеРИД</Name>
					<Comment>Предоставлении прав на использование результатов интеллектуальной деятельности или средств индивидуализации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежВыплата</Name>
					<Comment>Аванс, задаток, предоплата, кредит, взнос в счет оплаты, пени, штраф, вознаграждение, бонус и ином аналогичном предмете расчета</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АгентскоеВознаграждение</Name>
					<Comment>Вознаграждение пользователя, являющегося платежным агентом (субагентом), банковским платежным агентом (субагентом), комиссионером, поверенным или иным агентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоставнойПредметРасчета</Name>
					<Comment>Предмет расчета, состоящем из предметов, каждому из которых может быть присвоено другие значения перечисления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнойПредметРасчета</Name>
					<Comment>Предмет расчета,  не относящемуся к предметам расчета, которым может быть присвоено значение перечисления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмущественноеПраво</Name>
					<Comment>Передача имущественных прав</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнереализационныйДоход</Name>
					<Comment>Внереализационный доход</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы</Name>
					<Comment>Сумма расходов, уменьшающих сумму налога (авансовых платежей) в соответствии с пунктом 3.1 статьи 346.21 Налогового кодекса РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговыйСбор</Name>
					<Comment>Сумма уплаченного торгового сбора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КурортныйСбор</Name>
					<Comment>Курортный сбор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Залог</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Catalogs/ПризнакиПредметовРасчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПреопределенныеЭлементы() Экспорт
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.Товар.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о реализуемом товаре, за исключением подакцизного товара (наименование и иные сведения, описывающие товар)'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ПодакцизныйТовар.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о реализуемом подакцизном товаре (наименование и иные сведения, описывающие товар)'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПодакцизныйТовар;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.Работа.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о выполняемой работе (наименование и иные сведения, описывающие работу)'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Работа;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.Услуга.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения об оказываемой услуге (наименование и иные сведения, описывающие услугу)'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Услуга;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.СтавкаАзартнойИгры.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о приеме ставок при осуществлении деятельности по организации и проведению азартных игр'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.СтавкаАзартнойИгры;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ВыигрышАзартнойИгры.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о выплате денежных средств в виде выигрыша при осуществлении деятельности по организации и проведению азартных игр'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ВыигрышАзартнойИгры;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ЛотерейныйБилет.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о приеме денежных средств при реализации лотерейных билетов, электронных лотерейных билетов, приеме лотерейных ставок при осуществлении деятельности по организации и проведению лотерей'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ЛотерейныйБилет;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ВыигрышЛотереи.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о выплате денежных средств в виде выигрыша при осуществлении деятельности по организации и проведению лотерей'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ВыигрышЛотереи;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ПредставлениеРИД.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о предоставлении прав на использование результатов интеллектуальной деятельности или средств индивидуализации'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПредоставлениеРИД;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.Платеж.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения об авансе, задатке, предоплате, кредите, взносе в счет оплаты, пени, штрафе, вознаграждении, бонусе и ином аналогичном предмете расчета'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.СоставнойПредметРасчета.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о предмете расчета, состоящем из предметов, каждому из которых может быть присвоено значение от «0» до «10»'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.СоставнойПредметРасчета;
	ЭлементСправочникаОбъект.Записать();
	
	ЭлементСправочникаОбъект = Справочники.ПризнакиПредметовРасчета.ИнойПредметРасчета.ПолучитьОбъект();
	ЭлементСправочникаОбъект.ФорматПФ = ВРЕГ(ЭлементСправочникаОбъект.Наименование);
	ЭлементСправочникаОбъект.Комментарий = НСтр("ru = 'Сведения о предмете расчета, не относящемуся к предметам расчета, которым может быть присвоено значение от «0» до «11»'");
	ЭлементСправочникаОбъект.ТипПризнакаПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ИнойПредметРасчета;
	ЭлементСправочникаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
